TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL2 register
//
//*************************************************************************************************
#define GPIO_GPCCSEL2_GPIO72_S   0U
#define GPIO_GPCCSEL2_GPIO72_M   0xFU          // GPIO72 Controller CPU Select
#define GPIO_GPCCSEL2_GPIO73_S   4U
#define GPIO_GPCCSEL2_GPIO73_M   0xF0U         // GPIO73 Controller CPU Select
#define GPIO_GPCCSEL2_GPIO74_S   8U
#define GPIO_GPCCSEL2_GPIO74_M   0xF00U        // GPIO74 Controller CPU Select
#define GPIO_GPCCSEL2_GPIO75_S   12U
#define GPIO_GPCCSEL2_GPIO75_M   0xF000U       // GPIO75 Controller CPU Select
#define GPIO_GPCCSEL2_GPIO76_S   16U
#define GPIO_GPCCSEL2_GPIO76_M   0xF0000U      // GPIO76 Controller CPU Select
#define GPIO_GPCCSEL2_GPIO77_S   20U
#define GPIO_GPCCSEL2_GPIO77_M   0xF00000U     // GPIO77 Controller CPU Select
#define GPIO_GPCCSEL2_GPIO78_S   24U
#define GPIO_GPCCSEL2_GPIO78_M   0xF000000U    // GPIO78 Controller CPU Select
#define GPIO_GPCCSEL2_GPIO79_S   28U
#define GPIO_GPCCSEL2_GPIO79_M   0xF0000000U   // GPIO79 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPCCSEL3_GPIO80_S   0U
#define GPIO_GPCCSEL3_GPIO80_M   0xFU    // GPIO80 Controller CPU Select
#define GPIO_GPCCSEL3_GPIO81_S   4U
#define GPIO_GPCCSEL3_GPIO81_M   0xF0U   // GPIO81 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCLOCK register
//
//*************************************************************************************************
#define GPIO_GPCLOCK_GPIO64   0x1U       // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO65   0x2U       // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO66   0x4U       // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO67   0x8U       // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO68   0x10U      // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO69   0x20U      // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO70   0x40U      // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO71   0x80U      // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO72   0x100U     // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO73   0x200U     // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO74   0x400U     // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO75   0x800U     // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO76   0x1000U    // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO77   0x2000U    // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO78   0x4000U    // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO79   0x8000U    // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO80   0x10000U   // Configuration Lock bit for this pin
#define GPIO_GPCLOCK_GPIO81   0x20000U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCCR register
//
//*************************************************************************************************
#define GPIO_GPCCR_GPIO64   0x1U       // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO65   0x2U       // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO66   0x4U       // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO67   0x8U       // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO68   0x10U      // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO69   0x20U      // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO70   0x40U      // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO71   0x80U      // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO72   0x100U     // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO73   0x200U     // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO74   0x400U     // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO75   0x800U     // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO76   0x1000U    // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO77   0x2000U    // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO78   0x4000U    // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO79   0x8000U    // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO80   0x10000U   // Configuration lock commit bit for this pin
#define GPIO_GPCCR_GPIO81   0x20000U   // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCTRL register
//
//*************************************************************************************************
#define GPIO_GPGCTRL_QUALPRD2_S   16U
#define GPIO_GPGCTRL_QUALPRD2_M   0xFF0000U   // Qualification sampling period for GPIO208 to
                                              // GPIO215

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPGQSEL2_GPIO208_S   0U
#define GPIO_GPGQSEL2_GPIO208_M   0x3U      // Select input qualification type for GPIO208
#define GPIO_GPGQSEL2_GPIO209_S   2U
#define GPIO_GPGQSEL2_GPIO209_M   0xCU      // Select input qualification type for GPIO209
#define GPIO_GPGQSEL2_GPIO210_S   4U
#define GPIO_GPGQSEL2_GPIO210_M   0x30U     // Select input qualification type for GPIO210
#define GPIO_GPGQSEL2_GPIO211_S   6U
#define GPIO_GPGQSEL2_GPIO211_M   0xC0U     // Select input qualification type for GPIO211
#define GPIO_GPGQSEL2_GPIO212_S   8U
#define GPIO_GPGQSEL2_GPIO212_M   0x300U    // Select input qualification type for GPIO212
#define GPIO_GPGQSEL2_GPIO213_S   10U
#define GPIO_GPGQSEL2_GPIO213_M   0xC00U    // Select input qualification type for GPIO213
#define GPIO_GPGQSEL2_GPIO214_S   12U
#define GPIO_GPGQSEL2_GPIO214_M   0x3000U   // Select input qualification type for GPIO214
#define GPIO_GPGQSEL2_GPIO215_S   14U
#define GPIO_GPGQSEL2_GPIO215_M   0xC000U   // Select input qualification type for GPIO215

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPGMUX2_GPIO208_S   0U
#define GPIO_GPGMUX2_GPIO208_M   0x3U      // Defines pin-muxing selection for GPIO208
#define GPIO_GPGMUX2_GPIO209_S   2U
#define GPIO_GPGMUX2_GPIO209_M   0xCU      // Defines pin-muxing selection for GPIO209
#define GPIO_GPGMUX2_GPIO210_S   4U
#define GPIO_GPGMUX2_GPIO210_M   0x30U     // Defines pin-muxing selection for GPIO210
#define GPIO_GPGMUX2_GPIO211_S   6U
#define GPIO_GPGMUX2_GPIO211_M   0xC0U     // Defines pin-muxing selection for GPIO211
#define GPIO_GPGMUX2_GPIO212_S   8U
#define GPIO_GPGMUX2_GPIO212_M   0x300U    // Defines pin-muxing selection for GPIO212
#define GPIO_GPGMUX2_GPIO213_S   10U
#define GPIO_GPGMUX2_GPIO213_M   0xC00U    // Defines pin-muxing selection for GPIO213
#define GPIO_GPGMUX2_GPIO214_S   12U
#define GPIO_GPGMUX2_GPIO214_M   0x3000U   // Defines pin-muxing selection for GPIO214
#define GPIO_GPGMUX2_GPIO215_S   14U
#define GPIO_GPGMUX2_GPIO215_M   0xC000U   // Defines pin-muxing selection for GPIO215

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGDIR register
//
//*************************************************************************************************
#define GPIO_GPGDIR_GPIO211   0x80000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO212   0x100000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO213   0x200000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO214   0x400000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO215   0x800000U   // Defines direction for this pin in GPIO mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGPUD register
//
//*************************************************************************************************
#define GPIO_GPGPUD_GPIO208   0x10000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO209   0x20000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO210   0x40000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO211   0x80000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO212   0x100000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO213   0x200000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO214   0x400000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO215   0x800000U   // Pull-Up Disable control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGINV register
//
//*************************************************************************************************
#define GPIO_GPGINV_GPIO208   0x10000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO209   0x20000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO210   0x40000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO211   0x80000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO212   0x100000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO213   0x200000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO214   0x400000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO215   0x800000U   // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGODR register
//
//*************************************************************************************************
#define GPIO_GPGODR_GPIO211   0x80000U    // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO212   0x100000U   // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO213   0x200000U   // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO214   0x400000U   // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO215   0x800000U   // Output Open-Drain control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGAMSEL register
//
//*************************************************************************************************
#define GPIO_GPGAMSEL_GPIO208   0x10000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO209   0x20000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO210   0x40000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO211   0x80000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO212   0x100000U   // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO213   0x200000U   // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO214   0x400000U   // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO215   0x800000U   // Analog Mode select for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPGGMUX2_GPIO208_S   0U
#define GPIO_GPGGMUX2_GPIO208_M   0x3U      // Defines pin-muxing selection for GPIO208
#define GPIO_GPGGMUX2_GPIO209_S   2U
#define GPIO_GPGGMUX2_GPIO209_M   0xCU      // Defines pin-muxing selection for GPIO209
#define GPIO_GPGGMUX2_GPIO210_S   4U
#define GPIO_GPGGMUX2_GPIO210_M   0x30U     // Defines pin-muxing selection for GPIO210
#define GPIO_GPGGMUX2_GPIO211_S   6U
#define GPIO_GPGGMUX2_GPIO211_M   0xC0U     // Defines pin-muxing selection for GPIO211
#define GPIO_GPGGMUX2_GPIO212_S   8U
#define GPIO_GPGGMUX2_GPIO212_M   0x300U    // Defines pin-muxing selection for GPIO212
#define GPIO_GPGGMUX2_GPIO213_S   10U
#define GPIO_GPGGMUX2_GPIO213_M   0xC00U    // Defines pin-muxing selection for GPIO213
#define GPIO_GPGGMUX2_GPIO214_S   12U
#define GPIO_GPGGMUX2_GPIO214_M   0x3000U   // Defines pin-muxing selection for GPIO214
#define GPIO_GPGGMUX2_GPIO215_S   14U
#define GPIO_GPGGMUX2_GPIO215_M   0xC000U   // Defines pin-muxing selection for GPIO215

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL3_GPIO208_S   0U
#define GPIO_GPGCSEL3_GPIO208_M   0xFU          // GPIO208 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO209_S   4U
#define GPIO_GPGCSEL3_GPIO209_M   0xF0U         // GPIO209 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO210_S   8U
#define GPIO_GPGCSEL3_GPIO210_M   0xF00U        // GPIO210 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO211_S   12U
#define GPIO_GPGCSEL3_GPIO211_M   0xF000U       // GPIO211 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO212_S   16U
#define GPIO_GPGCSEL3_GPIO212_M   0xF0000U      // GPIO212 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO213_S   20U
#define GPIO_GPGCSEL3_GPIO213_M   0xF00000U     // GPIO213 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO214_S   24U
#define GPIO_GPGCSEL3_GPIO214_M   0xF000000U    // GPIO214 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO215_S   28U
#define GPIO_GPGCSEL3_GPIO215_M   0xF0000000U   // GPIO215 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGLOCK register
//
//*************************************************************************************************
#define GPIO_GPGLOCK_GPIO208   0x10000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO209   0x20000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO210   0x40000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO211   0x80000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO212   0x100000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO213   0x200000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO214   0x400000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO215   0x800000U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCR register
//
//*************************************************************************************************
#define GPIO_GPGCR_GPIO208   0x10000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO209   0x20000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO210   0x40000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO211   0x80000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO212   0x100000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO213   0x200000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO214   0x400000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO215   0x800000U   // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCTRL register
//
//*************************************************************************************************
#define GPIO_GPHCTRL_QUALPRD0_S   0U
#define GPIO_GPHCTRL_QUALPRD0_M   0xFFU         // Qualification sampling period for GPIO224 to
                                                // GPIO231
#define GPIO_GPHCTRL_QUALPRD1_S   8U
#define GPIO_GPHCTRL_QUALPRD1_M   0xFF00U       // Qualification sampling period for GPIO232 to
                                                // GPIO239
#define GPIO_GPHCTRL_QUALPRD2_S   16U
#define GPIO_GPHCTRL_QUALPRD2_M   0xFF0000U     // Qualification sampling period for GPIO240 to
                                                // GPIO247
#define GPIO_GPHCTRL_QUALPRD3_S   24U
#define GPIO_GPHCTRL_QUALPRD3_M   0xFF000000U   // Qualification sampling period for GPIO248 to
                                                // GPIO255

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPHQSEL1_GPIO224_S   0U
#define GPIO_GPHQSEL1_GPIO224_M   0x3U          // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO225_S   2U
#define GPIO_GPHQSEL1_GPIO225_M   0xCU          // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO226_S   4U
#define GPIO_GPHQSEL1_GPIO226_M   0x30U         // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO227_S   6U
#define GPIO_GPHQSEL1_GPIO227_M   0xC0U         // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO228_S   8U
#define GPIO_GPHQSEL1_GPIO228_M   0x300U        // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO229_S   10U
#define GPIO_GPHQSEL1_GPIO229_M   0xC00U        // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO230_S   12U
#define GPIO_GPHQSEL1_GPIO230_M   0x3000U       // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO231_S   14U
#define GPIO_GPHQSEL1_GPIO231_M   0xC000U       // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO232_S   16U
#define GPIO_GPHQSEL1_GPIO232_M   0x30000U      // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO233_S   18U
#define GPIO_GPHQSEL1_GPIO233_M   0xC0000U      // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO234_S   20U
#define GPIO_GPHQSEL1_GPIO234_M   0x300000U     // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO235_S   22U
#define GPIO_GPHQSEL1_GPIO235_M   0xC00000U     // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO236_S   24U
#define GPIO_GPHQSEL1_GPIO236_M   0x3000000U    // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO237_S   26U
#define GPIO_GPHQSEL1_GPIO237_M   0xC000000U    // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO238_S   28U
#define GPIO_GPHQSEL1_GPIO238_M   0x30000000U   // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO239_S   30U
#define GPIO_GPHQSEL1_GPIO239_M   0xC0000000U   // Select input qualification type for this GPIO
                                                // Pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPHQSEL2_GPIO240_S   0U
#define GPIO_GPHQSEL2_GPIO240_M   0x3U         // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO241_S   2U
#define GPIO_GPHQSEL2_GPIO241_M   0xCU         // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO242_S   4U
#define GPIO_GPHQSEL2_GPIO242_M   0x30U        // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO244_S   8U
#define GPIO_GPHQSEL2_GPIO244_M   0x300U       // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO245_S   10U
#define GPIO_GPHQSEL2_GPIO245_M   0xC00U       // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO247_S   14U
#define GPIO_GPHQSEL2_GPIO247_M   0xC000U      // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO248_S   16U
#define GPIO_GPHQSEL2_GPIO248_M   0x30000U     // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO249_S   18U
#define GPIO_GPHQSEL2_GPIO249_M   0xC0000U     // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO251_S   22U
#define GPIO_GPHQSEL2_GPIO251_M   0xC00000U    // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO252_S   24U
#define GPIO_GPHQSEL2_GPIO252_M   0x3000000U   // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO253_S   26U
#define GPIO_GPHQSEL2_GPIO253_M   0xC000000U   // Select input qualification type for this GPIO Pin

