TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHMUX1 register
//
//*************************************************************************************************
#define GPIO_GPHMUX1_GPIO224_S   0U
#define GPIO_GPHMUX1_GPIO224_M   0x3U          // Defines pin-muxing selection for GPIO224
#define GPIO_GPHMUX1_GPIO225_S   2U
#define GPIO_GPHMUX1_GPIO225_M   0xCU          // Defines pin-muxing selection for GPIO225
#define GPIO_GPHMUX1_GPIO226_S   4U
#define GPIO_GPHMUX1_GPIO226_M   0x30U         // Defines pin-muxing selection for GPIO226
#define GPIO_GPHMUX1_GPIO227_S   6U
#define GPIO_GPHMUX1_GPIO227_M   0xC0U         // Defines pin-muxing selection for GPIO227
#define GPIO_GPHMUX1_GPIO228_S   8U
#define GPIO_GPHMUX1_GPIO228_M   0x300U        // Defines pin-muxing selection for GPIO228
#define GPIO_GPHMUX1_GPIO229_S   10U
#define GPIO_GPHMUX1_GPIO229_M   0xC00U        // Defines pin-muxing selection for GPIO229
#define GPIO_GPHMUX1_GPIO230_S   12U
#define GPIO_GPHMUX1_GPIO230_M   0x3000U       // Defines pin-muxing selection for GPIO230
#define GPIO_GPHMUX1_GPIO231_S   14U
#define GPIO_GPHMUX1_GPIO231_M   0xC000U       // Defines pin-muxing selection for GPIO231
#define GPIO_GPHMUX1_GPIO232_S   16U
#define GPIO_GPHMUX1_GPIO232_M   0x30000U      // Defines pin-muxing selection for GPIO232
#define GPIO_GPHMUX1_GPIO233_S   18U
#define GPIO_GPHMUX1_GPIO233_M   0xC0000U      // Defines pin-muxing selection for GPIO233
#define GPIO_GPHMUX1_GPIO234_S   20U
#define GPIO_GPHMUX1_GPIO234_M   0x300000U     // Defines pin-muxing selection for GPIO234
#define GPIO_GPHMUX1_GPIO235_S   22U
#define GPIO_GPHMUX1_GPIO235_M   0xC00000U     // Defines pin-muxing selection for GPIO235
#define GPIO_GPHMUX1_GPIO236_S   24U
#define GPIO_GPHMUX1_GPIO236_M   0x3000000U    // Defines pin-muxing selection for GPIO236
#define GPIO_GPHMUX1_GPIO237_S   26U
#define GPIO_GPHMUX1_GPIO237_M   0xC000000U    // Defines pin-muxing selection for GPIO237
#define GPIO_GPHMUX1_GPIO238_S   28U
#define GPIO_GPHMUX1_GPIO238_M   0x30000000U   // Defines pin-muxing selection for GPIO238
#define GPIO_GPHMUX1_GPIO239_S   30U
#define GPIO_GPHMUX1_GPIO239_M   0xC0000000U   // Defines pin-muxing selection for GPIO239

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHMUX2 register
//
//*************************************************************************************************
#define GPIO_GPHMUX2_GPIO240_S   0U
#define GPIO_GPHMUX2_GPIO240_M   0x3U         // Defines pin-muxing selection for GPIO240
#define GPIO_GPHMUX2_GPIO241_S   2U
#define GPIO_GPHMUX2_GPIO241_M   0xCU         // Defines pin-muxing selection for GPIO241
#define GPIO_GPHMUX2_GPIO242_S   4U
#define GPIO_GPHMUX2_GPIO242_M   0x30U        // Defines pin-muxing selection for GPIO242
#define GPIO_GPHMUX2_GPIO244_S   8U
#define GPIO_GPHMUX2_GPIO244_M   0x300U       // Defines pin-muxing selection for GPIO244
#define GPIO_GPHMUX2_GPIO245_S   10U
#define GPIO_GPHMUX2_GPIO245_M   0xC00U       // Defines pin-muxing selection for GPIO245
#define GPIO_GPHMUX2_GPIO247_S   14U
#define GPIO_GPHMUX2_GPIO247_M   0xC000U      // Defines pin-muxing selection for GPIO247
#define GPIO_GPHMUX2_GPIO248_S   16U
#define GPIO_GPHMUX2_GPIO248_M   0x30000U     // Defines pin-muxing selection for GPIO248
#define GPIO_GPHMUX2_GPIO249_S   18U
#define GPIO_GPHMUX2_GPIO249_M   0xC0000U     // Defines pin-muxing selection for GPIO249
#define GPIO_GPHMUX2_GPIO251_S   22U
#define GPIO_GPHMUX2_GPIO251_M   0xC00000U    // Defines pin-muxing selection for GPIO251
#define GPIO_GPHMUX2_GPIO252_S   24U
#define GPIO_GPHMUX2_GPIO252_M   0x3000000U   // Defines pin-muxing selection for GPIO252
#define GPIO_GPHMUX2_GPIO253_S   26U
#define GPIO_GPHMUX2_GPIO253_M   0xC000000U   // Defines pin-muxing selection for GPIO253

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHDIR register
//
//*************************************************************************************************
#define GPIO_GPHDIR_GPIO224   0x1U          // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO226   0x4U          // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO227   0x8U          // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO228   0x10U         // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO230   0x40U         // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO236   0x1000U       // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO242   0x40000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO247   0x800000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPHDIR_GPIO253   0x20000000U   // Defines direction for this pin in GPIO mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHPUD register
//
//*************************************************************************************************
#define GPIO_GPHPUD_GPIO224   0x1U          // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO225   0x2U          // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO226   0x4U          // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO227   0x8U          // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO228   0x10U         // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO229   0x20U         // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO230   0x40U         // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO231   0x80U         // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO232   0x100U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO233   0x200U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO234   0x400U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO235   0x800U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO236   0x1000U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO237   0x2000U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO238   0x4000U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO239   0x8000U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO240   0x10000U      // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO241   0x20000U      // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO242   0x40000U      // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO244   0x100000U     // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO245   0x200000U     // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO247   0x800000U     // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO248   0x1000000U    // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO249   0x2000000U    // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO251   0x8000000U    // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO252   0x10000000U   // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO253   0x20000000U   // Pull-Up Disable control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHINV register
//
//*************************************************************************************************
#define GPIO_GPHINV_GPIO224   0x1U          // Input inversion control for this pin
#define GPIO_GPHINV_GPIO225   0x2U          // Input inversion control for this pin
#define GPIO_GPHINV_GPIO226   0x4U          // Input inversion control for this pin
#define GPIO_GPHINV_GPIO227   0x8U          // Input inversion control for this pin
#define GPIO_GPHINV_GPIO228   0x10U         // Input inversion control for this pin
#define GPIO_GPHINV_GPIO229   0x20U         // Input inversion control for this pin
#define GPIO_GPHINV_GPIO230   0x40U         // Input inversion control for this pin
#define GPIO_GPHINV_GPIO231   0x80U         // Input inversion control for this pin
#define GPIO_GPHINV_GPIO232   0x100U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO233   0x200U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO234   0x400U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO235   0x800U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO236   0x1000U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO237   0x2000U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO238   0x4000U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO239   0x8000U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO240   0x10000U      // Input inversion control for this pin
#define GPIO_GPHINV_GPIO241   0x20000U      // Input inversion control for this pin
#define GPIO_GPHINV_GPIO242   0x40000U      // Input inversion control for this pin
#define GPIO_GPHINV_GPIO244   0x100000U     // Input inversion control for this pin
#define GPIO_GPHINV_GPIO245   0x200000U     // Input inversion control for this pin
#define GPIO_GPHINV_GPIO247   0x800000U     // Input inversion control for this pin
#define GPIO_GPHINV_GPIO248   0x1000000U    // Input inversion control for this pin
#define GPIO_GPHINV_GPIO249   0x2000000U    // Input inversion control for this pin
#define GPIO_GPHINV_GPIO251   0x8000000U    // Input inversion control for this pin
#define GPIO_GPHINV_GPIO252   0x10000000U   // Input inversion control for this pin
#define GPIO_GPHINV_GPIO253   0x20000000U   // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHODR register
//
//*************************************************************************************************
#define GPIO_GPHODR_GPIO224   0x1U          // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO226   0x4U          // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO227   0x8U          // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO228   0x10U         // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO230   0x40U         // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO236   0x1000U       // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO242   0x40000U      // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO247   0x800000U     // Output Open-Drain control for this pin
#define GPIO_GPHODR_GPIO253   0x20000000U   // Output Open-Drain control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHAMSEL register
//
//*************************************************************************************************
#define GPIO_GPHAMSEL_GPIO224   0x1U          // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO225   0x2U          // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO226   0x4U          // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO227   0x8U          // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO228   0x10U         // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO229   0x20U         // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO230   0x40U         // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO231   0x80U         // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO232   0x100U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO233   0x200U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO234   0x400U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO235   0x800U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO236   0x1000U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO237   0x2000U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO238   0x4000U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO239   0x8000U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO240   0x10000U      // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO241   0x20000U      // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO242   0x40000U      // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO244   0x100000U     // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO245   0x200000U     // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO247   0x800000U     // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO248   0x1000000U    // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO249   0x2000000U    // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO251   0x8000000U    // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO252   0x10000000U   // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO253   0x20000000U   // Analog Mode select for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPHGMUX1_GPIO224_S   0U
#define GPIO_GPHGMUX1_GPIO224_M   0x3U          // Defines pin-muxing selection for GPIO224
#define GPIO_GPHGMUX1_GPIO225_S   2U
#define GPIO_GPHGMUX1_GPIO225_M   0xCU          // Defines pin-muxing selection for GPIO225
#define GPIO_GPHGMUX1_GPIO226_S   4U
#define GPIO_GPHGMUX1_GPIO226_M   0x30U         // Defines pin-muxing selection for GPIO226
#define GPIO_GPHGMUX1_GPIO227_S   6U
#define GPIO_GPHGMUX1_GPIO227_M   0xC0U         // Defines pin-muxing selection for GPIO227
#define GPIO_GPHGMUX1_GPIO228_S   8U
#define GPIO_GPHGMUX1_GPIO228_M   0x300U        // Defines pin-muxing selection for GPIO228
#define GPIO_GPHGMUX1_GPIO229_S   10U
#define GPIO_GPHGMUX1_GPIO229_M   0xC00U        // Defines pin-muxing selection for GPIO229
#define GPIO_GPHGMUX1_GPIO230_S   12U
#define GPIO_GPHGMUX1_GPIO230_M   0x3000U       // Defines pin-muxing selection for GPIO230
#define GPIO_GPHGMUX1_GPIO231_S   14U
#define GPIO_GPHGMUX1_GPIO231_M   0xC000U       // Defines pin-muxing selection for GPIO231
#define GPIO_GPHGMUX1_GPIO232_S   16U
#define GPIO_GPHGMUX1_GPIO232_M   0x30000U      // Defines pin-muxing selection for GPIO232
#define GPIO_GPHGMUX1_GPIO233_S   18U
#define GPIO_GPHGMUX1_GPIO233_M   0xC0000U      // Defines pin-muxing selection for GPIO233
#define GPIO_GPHGMUX1_GPIO234_S   20U
#define GPIO_GPHGMUX1_GPIO234_M   0x300000U     // Defines pin-muxing selection for GPIO234
#define GPIO_GPHGMUX1_GPIO235_S   22U
#define GPIO_GPHGMUX1_GPIO235_M   0xC00000U     // Defines pin-muxing selection for GPIO235
#define GPIO_GPHGMUX1_GPIO236_S   24U
#define GPIO_GPHGMUX1_GPIO236_M   0x3000000U    // Defines pin-muxing selection for GPIO236
#define GPIO_GPHGMUX1_GPIO237_S   26U
#define GPIO_GPHGMUX1_GPIO237_M   0xC000000U    // Defines pin-muxing selection for GPIO237
#define GPIO_GPHGMUX1_GPIO238_S   28U
#define GPIO_GPHGMUX1_GPIO238_M   0x30000000U   // Defines pin-muxing selection for GPIO238
#define GPIO_GPHGMUX1_GPIO239_S   30U
#define GPIO_GPHGMUX1_GPIO239_M   0xC0000000U   // Defines pin-muxing selection for GPIO239

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPHGMUX2_GPIO240_S   0U
#define GPIO_GPHGMUX2_GPIO240_M   0x3U         // Defines pin-muxing selection for GPIO240
#define GPIO_GPHGMUX2_GPIO241_S   2U
#define GPIO_GPHGMUX2_GPIO241_M   0xCU         // Defines pin-muxing selection for GPIO241
#define GPIO_GPHGMUX2_GPIO242_S   4U
#define GPIO_GPHGMUX2_GPIO242_M   0x30U        // Defines pin-muxing selection for GPIO242
#define GPIO_GPHGMUX2_GPIO244_S   8U
#define GPIO_GPHGMUX2_GPIO244_M   0x300U       // Defines pin-muxing selection for GPIO244
#define GPIO_GPHGMUX2_GPIO245_S   10U
#define GPIO_GPHGMUX2_GPIO245_M   0xC00U       // Defines pin-muxing selection for GPIO245
#define GPIO_GPHGMUX2_GPIO247_S   14U
#define GPIO_GPHGMUX2_GPIO247_M   0xC000U      // Defines pin-muxing selection for GPIO247
#define GPIO_GPHGMUX2_GPIO248_S   16U
#define GPIO_GPHGMUX2_GPIO248_M   0x30000U     // Defines pin-muxing selection for GPIO248
#define GPIO_GPHGMUX2_GPIO249_S   18U
#define GPIO_GPHGMUX2_GPIO249_M   0xC0000U     // Defines pin-muxing selection for GPIO249
#define GPIO_GPHGMUX2_GPIO251_S   22U
#define GPIO_GPHGMUX2_GPIO251_M   0xC00000U    // Defines pin-muxing selection for GPIO251
#define GPIO_GPHGMUX2_GPIO252_S   24U
#define GPIO_GPHGMUX2_GPIO252_M   0x3000000U   // Defines pin-muxing selection for GPIO252
#define GPIO_GPHGMUX2_GPIO253_S   26U
#define GPIO_GPHGMUX2_GPIO253_M   0xC000000U   // Defines pin-muxing selection for GPIO253

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCSEL1 register
//
//*************************************************************************************************
#define GPIO_GPHCSEL1_GPIO224_S   0U
#define GPIO_GPHCSEL1_GPIO224_M   0xFU          // GPIO224 Controller CPU Select
#define GPIO_GPHCSEL1_GPIO225_S   4U
#define GPIO_GPHCSEL1_GPIO225_M   0xF0U         // GPIO225 Controller CPU Select
#define GPIO_GPHCSEL1_GPIO226_S   8U
#define GPIO_GPHCSEL1_GPIO226_M   0xF00U        // GPIO226 Controller CPU Select
#define GPIO_GPHCSEL1_GPIO227_S   12U
#define GPIO_GPHCSEL1_GPIO227_M   0xF000U       // GPIO227 Controller CPU Select
#define GPIO_GPHCSEL1_GPIO228_S   16U
#define GPIO_GPHCSEL1_GPIO228_M   0xF0000U      // GPIO228 Controller CPU Select
#define GPIO_GPHCSEL1_GPIO229_S   20U
#define GPIO_GPHCSEL1_GPIO229_M   0xF00000U     // GPIO229 Controller CPU Select
#define GPIO_GPHCSEL1_GPIO230_S   24U
#define GPIO_GPHCSEL1_GPIO230_M   0xF000000U    // GPIO230 Controller CPU Select
#define GPIO_GPHCSEL1_GPIO231_S   28U
#define GPIO_GPHCSEL1_GPIO231_M   0xF0000000U   // GPIO231 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCSEL2 register
//
//*************************************************************************************************
#define GPIO_GPHCSEL2_GPIO232_S   0U
#define GPIO_GPHCSEL2_GPIO232_M   0xFU          // GPIO232 Controller CPU Select
#define GPIO_GPHCSEL2_GPIO233_S   4U
#define GPIO_GPHCSEL2_GPIO233_M   0xF0U         // GPIO233 Controller CPU Select
#define GPIO_GPHCSEL2_GPIO234_S   8U
#define GPIO_GPHCSEL2_GPIO234_M   0xF00U        // GPIO234 Controller CPU Select
#define GPIO_GPHCSEL2_GPIO235_S   12U
#define GPIO_GPHCSEL2_GPIO235_M   0xF000U       // GPIO235 Controller CPU Select
#define GPIO_GPHCSEL2_GPIO236_S   16U
#define GPIO_GPHCSEL2_GPIO236_M   0xF0000U      // GPIO236 Controller CPU Select
#define GPIO_GPHCSEL2_GPIO237_S   20U
#define GPIO_GPHCSEL2_GPIO237_M   0xF00000U     // GPIO237 Controller CPU Select
#define GPIO_GPHCSEL2_GPIO238_S   24U
#define GPIO_GPHCSEL2_GPIO238_M   0xF000000U    // GPIO238 Controller CPU Select
#define GPIO_GPHCSEL2_GPIO239_S   28U
#define GPIO_GPHCSEL2_GPIO239_M   0xF0000000U   // GPIO239 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPHCSEL3_GPIO240_S   0U
#define GPIO_GPHCSEL3_GPIO240_M   0xFU          // GPIO240 Controller CPU Select
#define GPIO_GPHCSEL3_GPIO241_S   4U
#define GPIO_GPHCSEL3_GPIO241_M   0xF0U         // GPIO241 Controller CPU Select
#define GPIO_GPHCSEL3_GPIO242_S   8U
#define GPIO_GPHCSEL3_GPIO242_M   0xF00U        // GPIO242 Controller CPU Select
#define GPIO_GPHCSEL3_GPIO244_S   16U
#define GPIO_GPHCSEL3_GPIO244_M   0xF0000U      // GPIO244 Controller CPU Select
#define GPIO_GPHCSEL3_GPIO245_S   20U
#define GPIO_GPHCSEL3_GPIO245_M   0xF00000U     // GPIO245 Controller CPU Select
#define GPIO_GPHCSEL3_GPIO247_S   28U
#define GPIO_GPHCSEL3_GPIO247_M   0xF0000000U   // GPIO247 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCSEL4 register
//
//*************************************************************************************************
#define GPIO_GPHCSEL4_GPIO248_S   0U
#define GPIO_GPHCSEL4_GPIO248_M   0xFU        // GPIO248 Controller CPU Select
#define GPIO_GPHCSEL4_GPIO249_S   4U
#define GPIO_GPHCSEL4_GPIO249_M   0xF0U       // GPIO249 Controller CPU Select
#define GPIO_GPHCSEL4_GPIO251_S   12U
#define GPIO_GPHCSEL4_GPIO251_M   0xF000U     // GPIO251 Controller CPU Select
#define GPIO_GPHCSEL4_GPIO252_S   16U
#define GPIO_GPHCSEL4_GPIO252_M   0xF0000U    // GPIO252 Controller CPU Select
#define GPIO_GPHCSEL4_GPIO253_S   20U
#define GPIO_GPHCSEL4_GPIO253_M   0xF00000U   // GPIO253 Controller CPU Select

