TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPBTOGGLE_GPIO32   0x1U          // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO33   0x2U          // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO34   0x4U          // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO35   0x8U          // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO37   0x20U         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO40   0x100U        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO41   0x200U        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO42   0x400U        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO43   0x800U        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO44   0x1000U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO45   0x2000U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO46   0x4000U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO47   0x8000U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO48   0x10000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO49   0x20000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO50   0x40000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO51   0x80000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO52   0x100000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO53   0x200000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO54   0x400000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO55   0x800000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO56   0x1000000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO57   0x2000000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO58   0x4000000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO59   0x8000000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO60   0x10000000U   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO61   0x20000000U   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO62   0x40000000U   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO63   0x80000000U   // Output Toggle bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCDAT register
//
//*************************************************************************************************
#define GPIO_GPCDAT_GPIO64   0x1U       // Data Register for this pin
#define GPIO_GPCDAT_GPIO65   0x2U       // Data Register for this pin
#define GPIO_GPCDAT_GPIO66   0x4U       // Data Register for this pin
#define GPIO_GPCDAT_GPIO67   0x8U       // Data Register for this pin
#define GPIO_GPCDAT_GPIO68   0x10U      // Data Register for this pin
#define GPIO_GPCDAT_GPIO69   0x20U      // Data Register for this pin
#define GPIO_GPCDAT_GPIO70   0x40U      // Data Register for this pin
#define GPIO_GPCDAT_GPIO71   0x80U      // Data Register for this pin
#define GPIO_GPCDAT_GPIO72   0x100U     // Data Register for this pin
#define GPIO_GPCDAT_GPIO73   0x200U     // Data Register for this pin
#define GPIO_GPCDAT_GPIO74   0x400U     // Data Register for this pin
#define GPIO_GPCDAT_GPIO75   0x800U     // Data Register for this pin
#define GPIO_GPCDAT_GPIO76   0x1000U    // Data Register for this pin
#define GPIO_GPCDAT_GPIO77   0x2000U    // Data Register for this pin
#define GPIO_GPCDAT_GPIO78   0x4000U    // Data Register for this pin
#define GPIO_GPCDAT_GPIO79   0x8000U    // Data Register for this pin
#define GPIO_GPCDAT_GPIO80   0x10000U   // Data Register for this pin
#define GPIO_GPCDAT_GPIO81   0x20000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCSET register
//
//*************************************************************************************************
#define GPIO_GPCSET_GPIO64   0x1U       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO65   0x2U       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO66   0x4U       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO67   0x8U       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO68   0x10U      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO69   0x20U      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO70   0x40U      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO71   0x80U      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO72   0x100U     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO73   0x200U     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO74   0x400U     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO75   0x800U     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO76   0x1000U    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO77   0x2000U    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO78   0x4000U    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO79   0x8000U    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO80   0x10000U   // Output Set bit for this pin
#define GPIO_GPCSET_GPIO81   0x20000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCCLEAR register
//
//*************************************************************************************************
#define GPIO_GPCCLEAR_GPIO64   0x1U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO65   0x2U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO66   0x4U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO67   0x8U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO68   0x10U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO69   0x20U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO70   0x40U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO71   0x80U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO72   0x100U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO73   0x200U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO74   0x400U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO75   0x800U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO76   0x1000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO77   0x2000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO78   0x4000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO79   0x8000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO80   0x10000U   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO81   0x20000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPCTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPCTOGGLE_GPIO64   0x1U       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO65   0x2U       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO66   0x4U       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO67   0x8U       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO68   0x10U      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO69   0x20U      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO70   0x40U      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO71   0x80U      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO72   0x100U     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO73   0x200U     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO74   0x400U     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO75   0x800U     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO76   0x1000U    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO77   0x2000U    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO78   0x4000U    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO79   0x8000U    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO80   0x10000U   // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO81   0x20000U   // Output Toggle bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGDAT register
//
//*************************************************************************************************
#define GPIO_GPGDAT_GPIO208   0x10000U    // Data Register for this pin
#define GPIO_GPGDAT_GPIO209   0x20000U    // Data Register for this pin
#define GPIO_GPGDAT_GPIO210   0x40000U    // Data Register for this pin
#define GPIO_GPGDAT_GPIO211   0x80000U    // Data Register for this pin
#define GPIO_GPGDAT_GPIO212   0x100000U   // Data Register for this pin
#define GPIO_GPGDAT_GPIO213   0x200000U   // Data Register for this pin
#define GPIO_GPGDAT_GPIO214   0x400000U   // Data Register for this pin
#define GPIO_GPGDAT_GPIO215   0x800000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGSET register
//
//*************************************************************************************************
#define GPIO_GPGSET_GPIO208   0x10000U    // Output Set bit for this pin
#define GPIO_GPGSET_GPIO209   0x20000U    // Output Set bit for this pin
#define GPIO_GPGSET_GPIO210   0x40000U    // Output Set bit for this pin
#define GPIO_GPGSET_GPIO211   0x80000U    // Output Set bit for this pin
#define GPIO_GPGSET_GPIO212   0x100000U   // Output Set bit for this pin
#define GPIO_GPGSET_GPIO213   0x200000U   // Output Set bit for this pin
#define GPIO_GPGSET_GPIO214   0x400000U   // Output Set bit for this pin
#define GPIO_GPGSET_GPIO215   0x800000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCLEAR register
//
//*************************************************************************************************
#define GPIO_GPGCLEAR_GPIO208   0x10000U    // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO209   0x20000U    // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO210   0x40000U    // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO211   0x80000U    // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO212   0x100000U   // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO213   0x200000U   // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO214   0x400000U   // Output Clear bit for this pin
#define GPIO_GPGCLEAR_GPIO215   0x800000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPGTOGGLE_GPIO208   0x10000U    // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO209   0x20000U    // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO210   0x40000U    // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO211   0x80000U    // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO212   0x100000U   // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO213   0x200000U   // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO214   0x400000U   // Output Toggle bit for this pin
#define GPIO_GPGTOGGLE_GPIO215   0x800000U   // Output Toggle bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHDAT register
//
//*************************************************************************************************
#define GPIO_GPHDAT_GPIO224   0x1U          // Data Register for this pin
#define GPIO_GPHDAT_GPIO225   0x2U          // Data Register for this pin
#define GPIO_GPHDAT_GPIO226   0x4U          // Data Register for this pin
#define GPIO_GPHDAT_GPIO227   0x8U          // Data Register for this pin
#define GPIO_GPHDAT_GPIO228   0x10U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO229   0x20U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO230   0x40U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO231   0x80U         // Data Register for this pin
#define GPIO_GPHDAT_GPIO232   0x100U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO233   0x200U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO234   0x400U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO235   0x800U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO236   0x1000U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO237   0x2000U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO238   0x4000U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO239   0x8000U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO240   0x10000U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO241   0x20000U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO242   0x40000U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO244   0x100000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO245   0x200000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO247   0x800000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO248   0x1000000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO249   0x2000000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO251   0x8000000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO252   0x10000000U   // Data Register for this pin
#define GPIO_GPHDAT_GPIO253   0x20000000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHSET register
//
//*************************************************************************************************
#define GPIO_GPHSET_GPIO224   0x1U          // Output Set bit for this pin
#define GPIO_GPHSET_GPIO225   0x2U          // Output Set bit for this pin
#define GPIO_GPHSET_GPIO226   0x4U          // Output Set bit for this pin
#define GPIO_GPHSET_GPIO227   0x8U          // Output Set bit for this pin
#define GPIO_GPHSET_GPIO228   0x10U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO229   0x20U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO230   0x40U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO231   0x80U         // Output Set bit for this pin
#define GPIO_GPHSET_GPIO232   0x100U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO233   0x200U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO234   0x400U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO235   0x800U        // Output Set bit for this pin
#define GPIO_GPHSET_GPIO236   0x1000U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO237   0x2000U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO238   0x4000U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO239   0x8000U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO240   0x10000U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO241   0x20000U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO242   0x40000U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO244   0x100000U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO245   0x200000U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO247   0x800000U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO248   0x1000000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO249   0x2000000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO251   0x8000000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO252   0x10000000U   // Output Set bit for this pin
#define GPIO_GPHSET_GPIO253   0x20000000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCLEAR register
//
//*************************************************************************************************
#define GPIO_GPHCLEAR_GPIO224   0x1U          // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO225   0x2U          // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO226   0x4U          // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO227   0x8U          // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO228   0x10U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO229   0x20U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO230   0x40U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO231   0x80U         // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO232   0x100U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO233   0x200U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO234   0x400U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO235   0x800U        // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO236   0x1000U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO237   0x2000U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO238   0x4000U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO239   0x8000U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO240   0x10000U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO241   0x20000U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO242   0x40000U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO244   0x100000U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO245   0x200000U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO247   0x800000U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO248   0x1000000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO249   0x2000000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO251   0x8000000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO252   0x10000000U   // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO253   0x20000000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPHTOGGLE_GPIO224   0x1U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO225   0x2U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO226   0x4U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO227   0x8U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO228   0x10U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO229   0x20U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO230   0x40U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO231   0x80U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO232   0x100U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO233   0x200U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO234   0x400U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO235   0x800U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO236   0x1000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO237   0x2000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO238   0x4000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO239   0x8000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO240   0x10000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO241   0x20000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO242   0x40000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO244   0x100000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO245   0x200000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO247   0x800000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO248   0x1000000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO249   0x2000000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO251   0x8000000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO252   0x10000000U   // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO253   0x20000000U   // Output Toggle bit for this pin




#endif
